
/*
 1. Задание: Четность числа

 Описание: Разработайте функцию, которая определяет, является ли предоставленное число четным.

 Требования:

 Функция определения:
 Создайте функцию, которая принимает число в качестве параметра.
 Функция должна возвращать true, если число четное, и false, если нечетное.
 Ожидаемый результат: При передаче числа в функцию, она вернет результат четности числа.

 2. Задание: Делимость на 3

 Описание: Разработайте функцию, которая проверяет, делится ли предоставленное число на 3 без остатка.

 Требования:

 Функция проверки:
 Создайте функцию, принимающую число в качестве параметра.
 Функция должна возвращать true, если число делится на 3 без остатка, и false в противном случае.
 Ожидаемый результат: При передаче числа в функцию, она вернет результат деления числа на 3 без остатка.

 3. Задание: Массив из 100 чисел

 Описание: Создайте возрастающий массив, содержащий 100 чисел.

 Требования:

 Создание массива:
 Массив должен начинаться с 1 и заканчиваться 100.
 Удалите из массива все четные числа и числа, которые не делятся на 3.
 Ожидаемый результат: В результате вы получите массив, в котором нет четных чисел и чисел, не делящихся на 3.

 4. Задание: Числа Фибоначчи

 Описание: Разработайте функцию, которая добавляет в массив новое число Фибоначчи.

 Требования:

 Функция Фибоначчи:
 Создайте функцию, которая добавляет в массив 50 чисел Фибоначчи.
 Числа Фибоначчи определяются соотношениями Fn=Fn-1 + Fn-2.
 Ожидаемый результат: Массив, содержащий 50 чисел Фибоначчи.
 
 5. Задание: Факториал числа

 Описание: Напишите функцию, которая рассчитывает факториал заданного числа N.

 Требования:

 Функция факториала:
 Функция принимает число N в качестве параметра.
 Функция должна возвращать значение факториала для N.
 Ожидаемый результат: При передаче числа в функцию, она вернет факториал этого числа.

 6. Задание: Простой калькулятор

 Описание: Разработайте программу, которая выполняет арифметические операции между двумя числами.

 Требования:

 Функция калькулятора:
 Функция принимает два числа и операцию (сложение, вычитание, умножение, деление) в качестве параметров.
 Функция должна возвращать результат выбранной операции.
 Ожидаемый результат: При передаче двух чисел и операции в функцию, она вернет результат этой операции.

 7. Задание: Длина строки

 Описание: Разработайте функцию, которая определяет длину заданной строки.

 Требования:

 Функция определения длины:
 Функция принимает строку в качестве параметра.
 Функция возвращает длину этой строки.
 Ожидаемый результат: При передаче строки в функцию, она вернет длину этой строки.

 8. Задание: Максимум из трех чисел

 Описание: Создайте функцию, которая определяет максимальное из трех предоставленных чисел.

 Требования:

 Функция нахождения максимума:
 Функция принимает три числа в качестве параметров.
 Функция возвращает наибольшее из трех чисел.
 Ожидаемый результат: При передаче трех чисел в функцию, она вернет наибольшее из них.

 9. Задание: Реверс строки

 Описание: Напишите функцию, которая переворачивает введенную пользователем строку.

 Требования:

 Функция реверса:
 Функция принимает строку в качестве параметра.
 Функция возвращает эту строку в обратном порядке.
 Ожидаемый результат: При передаче строки в функцию, она вернет эту строку в обратном порядке.

 10. Задание: Конвертация времени

 Описание: Разработайте функцию, которая преобразует время из секунд в часы, минуты и секунды.

 Требования:

 Функция конвертации времени:
 Функция принимает количество секунд в качестве параметра.
 Функция возвращает время в формате часы, минуты и секунды.
 Ожидаемый результат: При передаче количества секунд в функцию, она вернет это время в формате часы, минуты и секунды.

 11. Задание: Подсчет слов в строке

 Описание: Создайте функцию, которая определяет количество слов в заданной строке.

 Требования:

 Функция подсчета слов:
 Функция принимает строку в качестве параметра.
 Функция возвращает количество слов в этой строке.
 Ожидаемый результат: При передаче строки в функцию, она вернет количество слов в этой строке.
 */
